(spoilers
in
first
paragraph)
this
movie's
anti-german
sentiment
seems
painfully
dated
now,
but
it's
a
brilliant
example
of
great
war-time
propaganda.
it
was
made
back
when
cecil
b.
demille
still
director.
(ignore
all
his
later
best
picture
academy
awards;
he
never
very
good
sound
film.)
movie
lacks
the
comedy
most
pickford's
other
films,
and
really
demille's
movie,
not
pickford's.
vilification
germans
can
be
compared
to
way
"the
patriot"
2000
did
same
british.
only
german
film
reluctant
villain
who
had
ironic
name
austreheim.
they
even
pickford
take
an
ill-fated
trip
on
luxury
ship
that
gets
torpedoed
by
submarine.
so
what'll
get
americans
more
stirred
up
war?
sinking
lusitania,
or
watching
america's
favorite
canadian
import
it?
throughout
runs
protagonist
from
one
kind
horrible
calamity
another,
barely
escaping
death,
hypothermia,
depravity,
rape,
execution,
explosions
go
off
just
right
place
keep
her
unharmed.
she
is
saved
firing
squad
no
believable
than
humans
"jurassic
park"
were
ultimately
rescued
velociraptors.
if
i
any
gullible
such
propaganda
would
punish
myself
for
having
part-german
ancestry.
<br
/><br
/>was
film?
aside
humorous
running
gag
about
abroad
thinking
they're
untouchable

apparently
joke
then
you
might
entertained.
you'll
find
little
melodramatic,
obviously
one-sided,
thing
came
my
mind
after
years
before
potemkin's
false
portrayal
massacre
revolutionized
language
cinema
as
well
potential
me
wonder:
what
became
demille?
somewhere
between
advent
greatest
show
earth"
seemed
lose
ambition.
ben
hur
looked
expensive,
ambitious.
sentence,
1)
historians,
2)
silent
buffs,
3)
mary
fans,
4)
person
exists.
tv
specials
offered
elaborate
box
set,
"barbra
streisand:
television
specials",
released
last
november,
disc
being
separately
those
do
want
fork
over
dollars
five
specials.
investment,
indeed
bunch
fact
streisand
at
purest
eager
impress.
succeeds
brilliantly
key
component
legend.
signed
long-term
contract
with
cbs
produce
hour-long
variety
shows,
almost
extinct
format
nowadays,
22
special
broadcast
april
1965.
point
career,
notoriety
limited
handful
best-selling
albums,
few
dazzling
appearances
talk
successful
broadway
run
"funny
girl".<br
/>filmed
crisp
black-and-white,
program
divided
into
three
distinct
parts.
creative
transitional
use
"i'm
late"
disney's
"alice
wonderland",
segment
cleverly
shows
growing
childhood
through
numbers
diverse
"make
believe"
five".
opening
comic
monologue
pearl
istanbul,
second
part
moves
location
manhattan's
chic
bergdorf
goodman's
where
elegantly
costumed
series
glamorous
outfits
while
singing
depression-era
songs
like
"i've
got
plenty
nuthin'"
things
life
are
free"
irony.
basics,
third
straight-ahead
concert
which
opens
torchy
version
"when
sun
comes
out",
includes
girl"
medley,
ends
classic,
melancholic
"happy
days
here
again"
ending
credits.
also
included
brief
introduction
taped
1986
vhs.
know
pricey
tickets
political
fundraising,
genuine
eye-opener
why
revered
now.
recently
found
copy
$5
video
store,
snapped
eagerly.
music
(obviously)
graphics
aren't
standards
series,
beyond
mind's
eye,
am
entranced
segment:<br
/>stanley
stella
"breaking
ice".
brilliant,
emotions
feel
real.
clip
odyssey's
website
doesn't
have
story
nor
music,
unfortunately.
fido
cute
deserves
wider
recognition,
especially
considering
mainstream
crap
supposed
entertain
us
these
days.<br
/>as
has
already
been
pointed
out,
hardly
real
zombie
film,
rather
sweet
satire
employs
undead
fingers.
there
necessarily
some
bloody
scenes,
gore
presented
(feel-good
50s
style),
can't
imagine
anyone
actually
scared
turned
&
fellow
sufferers.<br
/>while
cast
generally
good,
felt
moss
nelson
stood
out.
humor
in-your-face,
subdued;
there's
lot
attention
detail
caught
smiling
benignly
several
movie.
certainly
masterpiece
cinema,
strive
-
instead,
currie
delivering
heart-warming
black
comedy.
meteor
crashes
crater
lake,
heat
impact
causing
prehistoric
egg
hatch.<br
/>alright,
plot
trash.
despite
its
obvious
low
budget,
across
gripping
entertaining
monster-on-the-loose
films
existence.
moments
humor.
age
filled
so-called
'monsters'
laughable
men-in-rubber-suit
creations
lizards
dressed
frills
forced
rip
each
pieces
(cheap
exploitation-style),
refreshing
discover
plesiosaur
gem
excellent
harryhausen-style
stop-motion
creature.<br
/>quite
hard
find,
worth
finding.
thought
man
drives
couple
hundreds
miles
lawn
mower
see
brother,
could
possibly
cinema?
didn't.
knew
expect:
boring
experiences
life.
wrong
haven't
too
often
yet,
because
best,
realistic
honest
hollywood
i've
ever
seen...<br
/>giving
short
resume
straight
story"
isn't
difficult.
old
stubborn
steps
another
state
pay
brother
visit
hears
severe
stroke.
that's
itself,
makes
hasn't
seen
ten
stupid
argument.
meantime
share
bad
luck
problems,
meets
people
whose
lives
influences
philosophical
approach
difficulties
weeks,
knowing
will
reach
goal:
seeing
again
late...<br
/>i
easily
understand
don't
reason
say
heart
that...
flashy
action
slow
driving
no,
watch
nice
soundtrack
either,
any.
should
then?
well,
simple
answer
story.
touching
powerful
make
better
disney
studio's
(that's
right,
studios
overwhelm
sugar
nonsense)
special.
i'm
ashamed
admit
tears
eyes
times
it,
probably
whole
situation
someone
many
argument
me.<br
/>some
argue
shallow,
agree
that.
perhaps
think
further.
look
close
enough
doing
knows
once
wrong,
pride
wants
everybody
else
too,
won't
mistake.
deep
enough,
how
much
deeper
does
add
all.
beautiful
landscapes
(finally
american
something
skyline
new
york,
chicago
big
city),
fine
acting
richard
farnsworth,
sissy
spacek,...
understandable
telling
david
lynch
now
completely
assuming
wouldn't
taste.
movies
long
time.
aimed
hit
bull's
eye.
give
full
10/10.
doctor
mordrid
rare
under
radar,
totally
worthwhile.
reminds
serials
30s
40s.
i'd
loved
follow-up
movies...
judging
rest
moon's
output
simply
weren't
tits
satisfy
typical
audience.
unfortunately,
thanks
superfluous
sacrifice
scene
two
family
audience
unfortunate,
without
em'
harry
potter-style
magicfest
kids
eaten
up.
both
jeffrey
combs
yvette
nipar
wasn't
sure
ms.
hadn't
wandered
a-list
onto
believable.
seriously!
anyway
shame
didn't
bucks
license
dr.
strange,
total
kiddie
phenom.
arthur
bach
decidedly
unhappy
multi-millionaire
attracted
'below
him'
social
standing
pays
hooker
scenes
enormously
shoplifter.<br
/>he
drinks
quite
sometimes
drinking,
course
funny,
ever.
/>the
behind
reality,
too.
john
gielgud
wipes
floor
everyone
screen
created
character
ages.
deserving
oscar.
moore
minnelli
their
moments,
"hobson"
remember
most.
storyline
actors
sets.
told
falling
asleep.
soundtrack.
anywhere.
please
email
able
fascinating.
swayze
job.
work.
past
ok,
change.
down
history
aired.
congrats
producers
writers
piece
marriage
maria
braun
(mmb)
girl
(maria)
getting
married
soldier
(herman
braun)
war.
half
day
night,
herman
send
front
again.
meet,
starts
working
bar
mainly
soldiers
soldier.
word
died
front,
develop
walks
them,
bed,
confrontation
him
american,
killed
american.
admits
murder,
jail
vows
wait
him.
country
shambles;
sees
leaving
everything
busy
cigarette.
food
shortages.
short,
time
survival
fittest.
/>basically
projects
maria's
attitudes
permits
herself
mentioned
circumstances,
metaphor
germany's
loss
soul
lost
war,
proceeds
rebuild
itself.
example,
following
conversation
peddler
(played
fassbinder
himself);
tries
sell
kleist
remarks
"kleist
burns
out
quickly,
provide
cold".
answers
"that's
it.
correct
way".
/>maria
french/german
business
man,
karl
oswald
bargains
class
train
compartment.
decides
involve
karl,
"you're
affair
me;
you".
takes
responsibility
company,
complete
trust
firm.
says
"i
suppose
we'll
miracle"
replies
prefer
making
miracles
them".
own
words,
become
"mata
hari
economic
miracle".<br
/>in
fassbinder's
tried
expose
psychological
processes
lie
mechanisms
(see
freud);
liked
pointing
camera
bullsh*t,
mechanisms,
pretending.
direct
convey
ideology.
phones
picks
phone
request
need
sleep
with".
said
exist
sentimentality
we
needed
properly
functioning
members
society".
remarked
anti
emotional.
particularly
meet
munich
restaurant
(apparently,
frequently
visited
hitler
himself).
appears
control
bit
side,
'brutal
honesty'
wears
anymore.
tell
love
life".
enjoy
eat
food".
guess
relationships,
submit
anyone.
you,
central
matter
"what
becomes
society
commodity,
instrument
power,
weapon."<br
/>it
betti
walking
expensive
dresses
ruins
war
clothing
essentially
period.
wanted
portray
attitudes,
bad,
"you
always
put
your
face
looking
great".
but,
interested
perfection.
mistakes
corrected
next
project.
since
completed
(approximately
4
year)
rolled
cigarettes,
peculiar
scenes.
peter
marthesheimer,
wrote
script,
likely
dreamed
park,
overnight.
/>hanna
schygulla
maria.
mostly,
stares
bluntly
camera.
words
"it
emotions.
that".
/>there
different
opinions
end.
hart
attack,
finally
left
australia
prison,
"become
human
again".)
testament
delivered
(made
half),
forgets
gas
stove
lights
cigarette,
blow
accident.
time,
must
rattled
dreams
seem
come
true.
outlived
herself.
impressionable
youth
experiencing
gundam
wing
upon
re-watching
reconfirmed
belief
beautifully
animated,
plot,
design,
depth
masterfully
executed.
appearing
boy
band
sorts,
stylish
attractiveness
characters
partly
credited
art,
individual
personalities
creating
clear
endearing
distinctions
among
characters.
consequently,
extremely
easy
drawn
particular
character.
personally,
heero
stoic
personality.
may
biased
sentimental
attachment
childhood,
objectively
addresses
questions
general
(how
obtain
peace?)
providing
packed
battles
large
robot
suits,
which,
least,
excellent.
sure,
sappy
clichés,
entertaining,
for.
natasha
henstridge
stunning,
hair.
smile
radiant
beauty
disguised.
michael
vartan,
women
them
eacb
film.
comments
chemistry
them.
see.<br
/>olivia
d'abo
rigoli
fun
watch,
d'abo's
british
accent
creep
bronx
speech.
truth
noticed
until
read
comments,
went
dvd
dialogue
sounds
me,
ideal
role
exception.
/>it's
significant
others,
mates
another.
unlikely
story,
play
documentaries?
unrealistic
dramas
screened
every
hour
tube.
escape
humdrum
daily
living
enter
world
screen.
job
hey,
guy
easily.
though,
scene,
those.<br
9/10
saving
10/10
yet
unseen
super
magnificent
along
day.
advertised
coming
channel
lifetime
movies,
whatever,
note
"tintin
i"
struck
documentary.
photography
editing
truly
breath-taking
(almost
anti-dogma).<br
/>we
follow
tintin
drawer
hergé
open-hearted
interview
1971.
background
ideological
fights
twentieth
century.
midst
demons
fight
with,
drawing
activity
attempt
tame
perfection.<br
/>even
though
spectacular
photographic
panoramas
drawings
albums
reconstructions
reading
passages
entirely
interviews
archive
material,
reconstructions.<br
/>hergé
lived
turbulent
true,
suffering
artist.
fantastic
imagination
continue
amaze
readers
side
victoria
albert
brought
director
jean-marc
valle.
people's
cursory
thoughts
queen
woman
reigned
decades
mourning.
emily
blunt
capable
title
gives
audiences
perspective.
portrays
youth,
ascension
throne,
early
years.
blunt's
fresh
restrained
strongest
(rupert
friend)
lord
melbourne
(paul
bettany).
acquit
themselves
including
miranda
richardson
throw-away
role.<br
/>though
dramatic
arcs
histrionic
"acting"
interesting
viewing.
historical
liberties
taken
writing,
stay
true
relationship
royal
structure
set
design
costumes
outstanding.<br
/>this
appreciated
history,
period
dramas,
actors.
heartily
recommend.<br
/>grade:
famous
collaborations
(such
cat
body
snatcher),
dandy
horror
casting
decisions
odd.
boris
karloff
plays
janos
rukh,
weird
scientist
carpathian
mountains--near
dracula
character's
home
town.
bela
lugosi
benet--whose
nationality
discussed
french.
sense
switch
roles,
tailor
lugosi--especially
accent.
however,
unusual
twist,
jobs.
karloff's
definitely
lead
role,
acquitted
himself
relatively
normal
person--something
films!!
rukh
pariah,
scientists
(especially
benet)
theories
bizarre
nonsensical.
turns
benet
generous
praise
rukh.
wonderful
element
discovered
nasty
effect
turning
crazy
killing
machine
(don't
hate
happens?).
mad
constructed,
nicely
developed
one-dimensional
killer,
complex
interesting.<br
bound
enjoyed
except
films.
universal
pictures
pulled
stops
bigger-budget
instead
cheap
quickies
unfortunately
gravitated
stuff.
spicy
film-making
sam
fuller
widmark
chance
edgy
skip
mccoy,
small-time
thief
stumbles
military
secret
picking
candy's
(jean
peters)
pocket
crowded
bus.
candy
favor
(ex?)boyfriend,
who's
"commies".<br
/>superficially,
mystery
regarding
motives
spends
determining
motives.
initially
assume
she's
"commie",
going
far
pour
beer
callous
gesture.
question
what's
skip?
motives,
much?
(the
audience)
basically
film-makers
done
create
striking
"male
fatale"
widmark's
performance.
male
tends
ponder
length
sleep"
glass
key"
main
whether
female
trustworthy
pretty
face,
similar
quandary
viewers.
handsome,
charm
boyish
insouciance
our
leading
lady,
robs
punches
face.
eventually
sink
buck
(his
police,
waving
flag
me?"
suspect
would)
revenge
murder
friend
moe
(thelma
ritter)?
conclusive
either
way.<br
/>thelma
ritter's
work
mention
indelible
here.
afraid
"business"
form
physical
objects
uses
draw
world,
used
ties.
fuller's
victor
perry
(an
actor
elsewhere
less
effect)
using
chopsticks
intimidate
candy.<br
emphasis
moe's
provides
cinema's
revealing
"honor
thieves"
themes.
ease
casual
notable
exception
capt.
tiger
(murvyn
vye)
grudge
against
invited
cops
pick
shack.
details
"realistic"
separate
questions.<br
/>all
told,
essential
crime
displays
durable
attributes
"film
noir"
school
film-making.
predictable
off-set
host
colorful
(uniformly
well-performed),
sets
disguised
film's
unrelenting
pace,
final
product
feels
substantial
is.
helps
he's
regarded
master
accomplished
failed
crimson
kimono"
"shock
corridor"
emphatic
styles
suspense.
performances
talent
tempted
(based
extraordinary
him)
comparable
alan
ladd
humphrey
bogart,
although
arguably
classic
enjoyable
reasons.
co-ordination
sequences
funny
slap
stick
moments.
robert
ginty
fred
williamson
memorable
together
near
end,
ginty,
around
buddy
boy!".
williamson,
written
napkin
four
lines
ad-libbed
likely.
30
parts
credit
list
10
so.
odd
maybe
insight
finished
look.
violent,
tripled
seeing.
fondness
chris
rock
varies
movies,i
hated
lethal
weapon
4,but
it.i
holding
back,like
dogma.
yet,wasn't
expecting
good.laughed
arse
delivers
backed
funniest
mom
took
christmas
1976.
barbra's
hair
one,
looks
great!
...and
number
copied
permed
time!
also,
bath
tub
kristoferson
sexy!
well.
groovy
70's
babs
best!
saw
august
27th
annual
national
association
journalists
convention
milwaukee,
wi,
public
screening.
great!!!
derek
luke
antwone
fisher.
young
bright
future.
fisher
writing
denzel's
direction
money.
weekend.
disappointed.
